% Реализует метод прогонки для решения систем с трехдиагональной матрицей
function [U, T] = thomas_algorithm(K, F, N)
    
    % Коэффициенты разложения
    S = zeros(N - 2, 1);
    T = zeros(N - 1, 1);
    U = zeros(N - 1, 1);
    tic
    S(1) = -K(1, 2) / K(1, 1);
    T(1) = F(1) / K(1, 1);

    % Заполняем столбцы коэффициентов
    for i = 2:1:(N - 2)
        S(i) = -K(i, i + 1) / (K(i, i) + K(i, i - 1) * S(i - 1));
    end
    for i = 2:1:(N - 1)
        T(i) = (F(i) - K(i, i - 1) * T(i - 1)) / (K(i, i) + ...
            K(i, i - 1) * S(i - 1));
    end
    U(N - 1) = T(N - 1);

    % Обратная прогонка
    for i = (N - 2):-1:1
        U(i) = S(i) * U(i + 1) + T(i);
    end
    T = toc;
end