%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция нахождения корня на отрезке методом бисекции
function [x_0, nIter, len, dev] = bisection(f_0, epsilon, ab, kMax)
    
    % Инициализация
    a = ab(1);
    b = ab(2);
    nIter = 0;
    
    % Проводим итерации, пока не достигнем точности epsilon
    while (((b - a) > 2 * epsilon) && (kMax > nIter))
        
        % Находим среднюю точку и обновляем счетчик
        c = (b + a) / 2;
        nIter = nIter + 1;
        
        % Проверяем, куда попал корень
        if (f_0(a) * f_0(c) < 0)
            b = c;
        else
            a = c;
        end
    end
    
    % Возвращаем требуемые значения
    x_0 = (b + a) / 2;
    len = b - a;
    dev = abs(f_0(x_0));
end