%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция для обнаружения промежутков перемены знака
function g = find_gaps(f_0, AB, N)
    
    % Ширина малого промежутка
    h = abs(double((AB(2) - AB(1)) / N));
    
    % Инициализация начальными значениями
    g = [];
    x_1 = AB(1);
    x_2 = x_1 + h;
    
    % Перебор всех малых промежутков
    while (x_2 <= AB(2))
        
        % Проверка на наличие корня
        if (f_0(x_1) * f_0(x_2) <= 0)
            g = [g; [x_1 x_2]];
        end
        
        % Переход к следующему малому промежутку
        x_1 = x_2;
        x_2 = x_2 + h;
    end
end