%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Программа предназначена для нахождения корней нелинейного уравнения 
% f(x) = 0 нечетной кратности. Для решения задачи используются 
% следующие численные методы:
%   1) Метод половинного деления (метод бисекции);
%   2) Метод Ньютона (метод касательных);
%   3) Модифицированный метод Ньютона;
%   4) Метод секущих.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% Входные параметры задачи 

% Символьное выражение для функции
syms x;
f = 2 ^ (-x) - sin(x);

% Промежуток задания и точность
AB = [-5 10];
epsilon = 10 ^ (-10);

%% Инициализация вспомогательных переменных

% Вспомогательные величины
N = 50;             % Количество отрезков для поиска
kMax = 100;         % Максимальное число итераций
delta = 10 ^ (-3);  % Оценка малой величины
nTryMax = 3;        % Кол-во попыток выбора начальной точки (МН и ММН)

% Выражения для производных
f_0 = matlabFunction(f);
f_1 = matlabFunction(diff(f));
abs_f_1 = matlabFunction(abs(diff(f)));

%% Приближенное вычисление корней

% Отделяем корни
g = find_gaps(f_0, AB, N);

% Записываем в файл основную информацию
print_info(f, AB, epsilon, 'output.txt');
print_gaps(g, 'output.txt');

% Метод бисекции
print_bisection(f_0, epsilon, g, kMax, 'output.txt');

% Метод Ньютона
print_newton(f_0, f_1, abs_f_1, epsilon, delta, g, kMax, ...
   nTryMax, 'output.txt');

% Модифицированный метод Ньютона
print_newton_m(f_0, f_1, abs_f_1, epsilon, delta, g, kMax, ...
   nTryMax, 'output.txt');

% Метод секущих
print_sechant_method(f_0, abs_f_1, epsilon, delta, g, kMax, 'output.txt');