%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция вывода промежутков перемены знака в файл
function print_gaps(g, name)
    
    % Открываем файл для записи
    fileId = fopen(name, 'a');
    
    % Вывод данных в файл 
    fprintf(fileId, '\n## Отрезки перемены знака функции');
    fprintf(fileId, '\nКоличество отрезков : %d', size(g, 1));
    for i = 1:size(g, 1)
        fprintf(fileId, '\n %2d) : [%.4f, %.4f]', i, g(i, 1), g(i, 2));
    end
    fprintf(fileId, '\n');
    
    % Закрываем файл для записи
    fclose(fileId);
end