%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция вывода результатов бисекции
function print_bisection(f_0, epsilon, g, kMax, name)
    
    % Открываем файл для записи
    fileId = fopen(name, 'a');
    fprintf(fileId, '\n## Метод бисекции');
    
    % Расчет корней для всех промежутков
    for i = 1:size(g, 1)
        
        % Расчет требуемых значений
        [x_0, nIter, len, dev] = bisection(f_0, epsilon, g(i, 1:2), kMax);
        
        % Вывод расчета в файл
        fprintf(fileId, '\nПромежуток : [%.4f, %.4f]', g(i, 1), g(i, 2));
        fprintf(fileId, '\n > Корень           : %.12e', x_0);
        fprintf(fileId, '\n > Число итераций   : %d', nIter);
        fprintf(fileId, '\n > Длина промежутка : %.12e', len);
        fprintf(fileId, '\n > Невязка          : %.12e', dev);
    end
    fprintf(fileId, '\n');
    
    % Закрываем файл для записи
    fclose(fileId);
end