%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция вывода данных задачи в файл
function print_info(f, AB, epsilon, name)
    
    % Открываем файл для записи
    fileId = fopen(name, 'a');
    fprintf(fileId, '\n## Входные данные');
    
    % Вывод данных в файл 
    fprintf(fileId, '\nВид функции       : f(x) = %s', char(f));
    fprintf(fileId, '\nПромежуток [A, B] : [%.4f, %.4f]', AB(1), AB(2));
    fprintf(fileId, '\nТочность          : epsilon = %e\n', epsilon);
    
    % Закрываем файл для записи
    fclose(fileId);
end