%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вычислительный практикум №1. Баталов Семен (351), 2022.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Функция нахождения корня на отрезке методом секущих
function [x_1, x_2, x, nIter, dev, isErr] = sechant_method(f_0, ...
    abs_f_1, epsilon, delta, ab, kMax)
    
    % Находим минимум модуля производной
    [~, m1] = fminbnd(abs_f_1, ab(1), ab(2));
    
    % Проверяем, что минимум не подходит близко к нулю
    if (m1 < delta)
        
        % Основное условие было нарушено
        isErr = true;
        x_1 = 0;
        x_2 = 0;
        x = 0;
        nIter = 0;
        dev = 0;
    else
        
        % Основное условие было выполнено
        isErr = false;
        
        % Стартовые точки - концы отрезка
        x_k1 = 0;
        x_k2 = ab(1);
        x_new = ab(2);
        nIter = 0;
        
        % Проводим итерации, пока не достигнем точности epsilon
        while (abs(f_0(x_new)) / m1 > epsilon) && (kMax > nIter)
            nIter = nIter + 1;
            x_k1 = x_k2;
            x_k2 = x_new;
            x_new = x_k2 - f_0(x_k2) * (x_k2 - x_k1) / ...
                (f_0(x_k2) - f_0(x_k1));
        end
        
        if (kMax > nIter)
            x = x_new;
            dev = abs(f_0(x));
            x_1 = ab(1);
            x_2 = ab(2);
        else
            isErr = true;
            x_1 = 0;
            x_2 = 0;
            x = 0;
            nIter = 0;
            dev = 0;
        end
    end
end